Autodesk.Revit.UI.IModelessUIProxy.AccessGranted
Modeless UI component is notified that it can access Revit document.
This is called in return to the "RequestAccess" that the UI component has to call on the ModelessUIManager
Since:
2017

Autodesk.Revit.UI.IModelessUIProxy.SelectionChanged
Modeless UI component is notified that current selection has changed
Remarks:
There are some restriction when this notificatios appears:
the client is not allowed to change the current selection, switch to a different document, switch to another view
Since:
2017